In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444, 555, 666, 444],
    'col3':['abc', 'def', 'ghi', 'xyz']
})

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Finding Unique Values

### unique()

In [4]:
df['col2'].unique()
# It will return an array containing unique values.

array([444, 555, 666], dtype=int64)

### nunique()

In [5]:
# To find number of unique values
df['col2'].nunique()

3

In [6]:
# There is one alternative method to do the same.
# We can find the length of array, we get from applying unique method on col2
len(df['col2'].unique())

3

### value_counts() - remmember it has a 's' in _counts()

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

## Conditional Selection

In [8]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
df[ (df['col1'] > 2) ]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [10]:
df[ (df['col1'] > 2) & (df['col2'] == 444) ]

   col1  col2 col3
3     4   444  xyz

# .apply()

It is very usefull when we have to broadcast some function or operartion on each value in column.
It is also usefull to peform lamda expressions.

In [11]:
# Suppose we have to find length of each string in col3
len(df['col3'])

4

In [12]:
# No, this is length of whole column
len(df['col3'][0])

3

In [13]:
# Yes this is what we want but this should be applied on each emelent in col3.
# To do so we use apply

In [14]:
df['col3'].apply(len)  # len() is built-in function

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [15]:
# We can use both built-in and custom funcions using apply.
def times2(num):
    return num * 2

In [16]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
# Alternative way
times2(df['col1'])   # This cannot be done with lambda functions, so we need apply approach

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [18]:
# But most usefull thing about .apply() is, it can apply lambda functions.
df['col1'].apply(lambda n: n*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

# drop()

In [19]:
# It is used to drop columns and rows.
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [21]:
df.drop(3)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

In [22]:
df.drop('col2', axis=1)

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

# Show column names and index

In [23]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [27]:
df.columns
# It returns index object containing all column names.

Index(['col1', 'col2', 'col3'], dtype='object')

In [29]:
df.index
# It will return the range of index

RangeIndex(start=0, stop=4, step=1)

# Sorting

In [32]:
df.sort_values(by ='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [36]:
df.sort_values('col3')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Check is there any null value

In [37]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Pivot tables

In [43]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [44]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [45]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN